// Security and Compliance
[
[
    {
        question: "AWS Shield Advanced provides expanded DDoS attack protection for web applications running on which of the following resources? (Select two)",
        options: ["Amazon Route 53", "AWS Elastic Beanstalk", "AWS Global Accelerator", "AWS CloudFormation"],
        answer: ["Amazon Route 53", "AWS Global Accelerator"],
        type: "multiple"
    },
    {
        question: "According to the AWS Shared Responsibility Model, which of the following are responsibilities of AWS? (Select two)",
        options: ["Operating the infrastructure layer, the operating system and the platform for the Amazon S3 service", "Creating S3 bucket policies for appropriate user access", "Creating IAM role for accessing Amazon EC2 instances", "Replacing faulty hardware of Amazon EC2 instances"],
        answer: ["Operating the infrastructure layer, the operating system and the platform for the Amazon S3 service", "Replacing faulty hardware of Amazon EC2 instances∏"],
        type: "multiple"
    },
    {
        question: "Which of the following AWS services has encryption enabled by default?",
        options: ["Amazon Elastic File System (Amazon EFS)", "AWS CloudTrail Logs", "Amazon Elastic Block Store (Amazon EBS)", "Amazon Relational Database Service (Amazon RDS)"],
        answer: ["AWS CloudTrail Logs"],
        type: "single"
    },
    {
        question: "Under the AWS Shared Responsibility Model, which of the following is a shared responsibility of both AWS and the customer?",
        options: ["Guarantee data separation among various AWS customers", "Configuration Management", "Infrastructure maintenance of Amazon Simple Storage Service (Amazon S3) storage servers", "Availability Zone (AZ) infrastructure maintenance"],
        answer: ["Configuration Management"],
        type: "single"
    },
    {
        question: "A company runs an application on a fleet of EC2 instances. The company wants to automate the traditional maintenance job of running timely assessments and checking for OS vulnerabilities. As a Cloud Practitioner, which service will you suggest for this use case?",
        options: ["AWS Shield", "Amazon Inspector", "Amazon GuardDuty", "Amazon Macie"],
        answer: ["Amazon Inspector"],
        type: "single"
    },
    {
        question: "A company wants to have control over creating and using its own keys for encryption on AWS services. Which of the following can be used for this use-case?",
        options: ["AWS owned key", "AWS managed key", "AWS Secrets Manager", "customer managed key (CMK)"],
        answer: ["customer managed key (CMK)"],
        type: "single"
    },
    {
        question: "Which security service of AWS is enabled for all AWS customers, by default, at no additional cost?",
        options: ["AWS Shield Advanced", "AWS Shield Standard", "AWS Secrets Manager", "AWS Web Application Firewall (AWS WAF)"],
        answer: ["AWS Shield Standard"],
        type: "single"
    },
    {
        question: "Which AWS Service can be used to mitigate a Distributed Denial of Service (DDoS) attack?",
        options: ["AWS Key Management Service (AWS KMS)", "Amazon CloudWatch", "AWS Systems Manager", "AWS Shield"],
        answer: ["AWS Shield"],
        type: "single"
    },
    {
        question: "A cyber forensics team has detected that AWS owned IP-addresses are being used to carry out malicious attacks. As this constitutes prohibited use of AWS services, which of the following is the correct solution to address this issue?",
        options: ["Contact AWS Developer Forum moderators", "Contact AWS Abuse Team", "Write an email to Jeff Bezos, the founder of Amazon, with the details of the incident", "Contact AWS Support"],
        answer: ["Contact AWS Abuse Team"],
        type: "single"
    },
    {
        question: "AWS Web Application Firewall (WAF) offers protection from common web exploits at which layer?",
        options: ["Layer 7", "Layer 4 and 7", "Layer 4", "Layer 3"],
        answer: ["Layer 7"],
        type: ""
    },
    {
        question: "Which of the following is a recommended way to provide programmatic access to AWS resources?",
        options: ["Create a new IAM user and share the username and password", "Use Access Key ID and Secret Access Key to access AWS resources programmatically", "Use IAM user group to access AWS resources programmatically", "Use AWS Multi-Factor Authentication (AWS MFA) to access AWS resources programmatically"],
        answer: ["Use Access Key ID and Secret Access Key to access AWS resources programmatically"],
        type: "single"
    },
    {
        question: "A web application stores all of its data on Amazon S3 buckets. A client has mandated that data be encrypted before sending it to Amazon S3. Which of the following is the right technique for encrypting data as needed by the customer?",
        options: ["Encryption is enabled by default for all the objects written to Amazon S3. Additional configuration is not required", "Enable server-side encryption with AWS Key Management Service (AWS KMS) keys (SSE-KMS)", "Enable client-side encryption using AWS encryption SDK", "Enable server-side encryption with Amazon S3 Managed Keys (SSE-S3)"],
        answer: ["Enable client-side encryption using AWS encryption SDK"],
        type: "single"
    },
    {
        question: "Which of the following AWS services support VPC Endpoint Gateway for a private connection from a VPC? (Select two)",
        options: ["Amazon Elastic Compute Cloud (Amazon EC2)", "Amazon DynamoDB", "Amazon Simple Notification Service (SNS)", "Amazon Simple Queue Service (SQS)", "Amazon Simple Storage Service (Amazon S3)"],
        answer: ["Amazon DynamoDB", "Amazon Simple Storage Service (Amazon S3)"],
        type: ""
    },
    {
        question: "A company uses reserved EC2 instances across multiple units with each unit having its own AWS account. However, some of the units under-utilize their reserved instances while other units need more reserved instances. As a Cloud Practitioner, which of the following would you recommend as the most cost-optimal solution?",
        options: ["Use AWS Organizations to manage AWS accounts of all units and then share the reserved EC2 instances amongst all units", "Use AWS Systems Manager to manage AWS accounts of all units and then share the reserved EC2 instances amongst all units", "Use AWS Cost Explorer to manage AWS accounts of all units and then share the reserved EC2 instances amongst all units", "Use AWS Trusted Advisor to manage AWS accounts of all units and then share the reserved EC2 instances amongst all units"],
        answer: ["Use AWS Organizations to manage AWS accounts of all units and then share the reserved EC2 instances amongst all units"],
        type: "single"
    },
    {
        question: "A medical research startup wants to understand the compliance of AWS services concerning HIPAA guidelines. Which AWS service can be used to review the HIPAA compliance and governance-related documents on AWS?",
        options: ["AWS Artifact", "AWS Systems Manager", "AWS Secrets Manager", "AWS Trusted Advisor"],
        answer: ["AWS Artifact"],
        type: "single"
    }
],

// Cloud Concepts

[
    {
        question: "Which of the following is CORRECT regarding removing an AWS account from AWS Organizations?",
        options: ["The AWS account must be able to operate as a standalone account. Only then it can be removed from AWS organizations", "Raise a support ticket with AWS Support to remove the account", "The AWS account can be removed from AWS Systems Manager", "The AWS account must not have any Service Control Policies (SCPs) attached to it. Only then it can be removed from AWS organizations"],
        answer: ["The AWS account must be able to operate as a standalone account. Only then it can be removed from AWS organizations"]
        type: "single"
    },
    {
        question: "What are the advantages that AWS Cloud offers over a traditional on-premises IT infrastructure? (Select two)",
        options: ["Make a capacity decision before deploying an application, to reduce costs", "Eliminate guessing on your infrastructure capacity needs", "Increase speed and agility by keeping servers and other required resources ready before time in your data centers", "Trade capital expense for variable expense"],
        answer: ["Eliminate guessing on your infrastructure capacity needs", "Trade capital expense for variable expense"]
        type: "multiple"
    },
    {
        question: "Which of the following is an INCORRECT statement about Scaling, a design principle of Reliability pillar of the AWS Well-Architected Framework?",
        options: ["A scale out operation implies you scale by adding more instances to your existing pool of resources", "A scale up operation implies you scale by adding more power (CPU, RAM) to your existing machine/node", "Fault tolerance is achieved by a scale out operation", "Fault tolerance is achieved by a scale up operation"],
        answer: ["Fault tolerance is achieved by a scale up operation"]
        type: "single"
    },
    {
        question: "Which of the following AWS services can be used to connect a company's on-premises environment to a VPC without using the public internet?",
        options: ["AWS Direct Connect", "AWS Site-to-Site VPN", "VPC Endpoint", "Internet Gateway"],
        answer: ["AWS Direct Connect"]
        type: "single"
    },
    {
        question: "Which option is a common stakeholder role for the AWS Cloud Adoption Framework (AWS CAF) platform perspective? (Select two)",
        options: ["Engineer", "Chief Product Officer (CPO)", "Chief Technology Officer (CTO)", "Chief Information Officer (CIO)"],
        answer: ["Chief Technology Officer (CTO)", "Engineering"]
        type: "multiple"
    },
    {
        question: "An IT company is planning to migrate from an on-premises environment to AWS Cloud. Which of the following expense areas would result in cost savings when the company moves to AWS Cloud? (Select two)",
        options: ["Data center physical security expenditure", "Data center hardware infrastructure expenditure", "SaaS application license fee", "Developer salary"],
        answer: ["Data center physical security expenditure", "Data center hardware infrastructure expenditure"]
        type: "multiple"
    },
    {
        question: "Which type of cloud computing does Amazon Elastic Compute Cloud (EC2) represent?",
        options: ["Network as a Service (NaaS)", "Infrastructure as a Service (IaaS)", "Platform as a Service (PaaS)", "Software as a Service (SaaS)"],
        answer: ["Infrastructure as a Service (IaaS)"]
        type: "single"
    },
    {
        question: "Which of the following is a benefit of using AWS managed services such as Amazon Relational Database Service (Amazon RDS)?",
        options: ["The performance of AWS managed Amazon Relational Database Service (Amazon RDS) instance is better than a customer-managed database instance", "The customer needs to patch the underlying OS", "There is no need to optimize database instance type and size", "The customer needs to manage database backups"],
        answer: ["The performance of AWS managed Amazon Relational Database Service (Amazon RDS) instance is better than a customer-managed database instance"]
        type: "single"
    },
    {
        question: "A multi-national company has just moved its infrastructure from its on-premises data center to AWS Cloud. As part of the shared responsibility model, AWS is responsible for which of the following?",
        options: ["Physical and Environmental controls", "Configuring customer applications", "Patching guest OS", "Service and Communications Protection or Zone Security"],
        answer: ["Physical and Environmental controls"]
        type: "single"
    },
    {
        question: "Which of the following statements are CORRECT regarding the AWS VPC service? (Select two)",
        options: ["A network access control list (network ACL) can have allow rules only", "A Security Group can have allow rules only", "A Security Group can have both allow and deny rules", "A Network Address Translation gateway (NAT gateway) is managed by AWS"],
        answer: ["A Security Group can have allow rules only", "A Network Address Translation gateway (NAT gateway) is managed by AWS"]
        type: "multiple"
    },
    {
        question: "A startup wants to migrate its data and applications from the on-premises data center to AWS Cloud. Which of the following options can be used by the startup to help with this migration? (Select two)",
        options: ["Consult moderators on AWS Developer Forums", "Leverage AWS Professional Services to accelerate the infrastructure migration", "Use AWS Trusted Advisor to automate the infrastructure migration", "Utilize AWS Partner Network (APN) to build a custom solution for this infrastructure migration"],
        answer: ["Leverage AWS Professional Services to accelerate the infrastructure migration", "Utilize AWS Partner Network (APN) to build a custom solution for this infrastructure migration"]
        type: "multiple"
    },
    {
        question: "Which of the following are the advantages of cloud computing? (Select three)",
        options: ["Allocate a few months of planning for your infrastructure capacity needs","Trade capital expense for variable expense", "Benefit from massive economies of scale", "Go global in minutes and deploy applications in multiple regions around the world with just a few clicks"],
        answer: ["Go global in minutes and deploy applications in multiple regions around the world with just a few clicks", "Benefit from massive economies of scale", "Trade capital expense for variable expense"]
        type: "multiple"
    },
    {
        question: "An e-commerce company has deployed an RDS database in a single Availability Zone (AZ). The engineering team wants to ensure that in case of an AZ outage, the database should continue working on the same endpoint without any manual administrative intervention. Which of the following solutions can address this use-case",
        options: ["Configure the database in RDS read replica mode with automatic failover to the standby", "Configure the database in RDS Multi-AZ deployment with automatic failover to the standby", "Provision the database via AWS CloudFormation", "Deploy the database via AWS Elastic Beanstalk"],
        answer: ["Configure the database in RDS Multi-AZ deployment with automatic failover to the standby"]
        type: "single"
    },
    {
        question: "A financial services company wants to ensure that its AWS account activity meets the governance, compliance and auditing norms. As a Cloud Practitioner, which AWS service would you recommend for this use-case?",
        options: ["AWS CloudTrail", "AWS Trusted Advisor", "Amazon CloudWatch", "AWS Config"],
        answer: ["AWS CloudTrail"]
        type: "single"
    },
    {
        question: "Which of the following AWS Support plans provide access to only core checks from the AWS Trusted Advisor Best Practice Checks? (Select two)",
        options: ["AWS Business Support", "AWS Enterprise Support", "AWS Basic Support", "AWS Developer Support", "AWS Enterprise On-Ramp Support"],
        answer: ["AWS Developer Support", "AWS Basic Support"]
        type: "multiple"
    },
    {
        question: "According to the AWS Cloud Adoption Framework (AWS CAF), what are two tasks that a company should perform when planning to migrate to the AWS Cloud and aiming to become more responsive to customer inquiries and feedback as part of their organizational transformation? (Select two)",
        options: ["Leverage legacy infrastructure for cost efficiencies", "Organize your teams around bureaucratic design principles", "Create new analytical insights with existing products and services", "Leverage agile methods to rapidly iterate and evolve", "Organize your teams around products and value streams"],
        answer: ["Organize your teams around products and value streams", "Leverage agile methods to rapidly iterate and evolve"]
        type: "multiple"
    },
    {
        question: "A company wants to move to AWS cloud and release new features with quick iterations by utilizing relevant AWS services whenever required. Which of the following characteristics of AWS Cloud does it want to leverage?",
        options: ["Reliability", "Elasticity", "Agility", "Scalability"],
        answer: ["Agility"]
        type: "multiple"
    },
    {
        question: "A multi-national corporation wants to get expert professional advice on migrating to AWS and managing their applications on AWS Cloud. Which of the following entities would you recommend for this engagement?",
        options: ["APN Technology Partner", "Concierge Support Team", "APN Consulting Partner", "AWS Trusted Advisor"],
        answer: ["APN Consulting Partner"]
        type: "single"
    }
],

// Billing and Pricing
[
    {
        question: "Which AWS service will help you receive alerts when the reservation utilization falls below the defined threshold?",
        options: ["AWS Budgets", "AWS Trusted Advisor", "AWS Pricing Calculator", "AWS CloudTrail"],
        answer: ["AWS Budgets"]
        type: "single"
    },
    {
        question: "Which AWS Support plan provides architectural guidance contextual to your specific use-cases?",
        options: ["AWS Developer Support", "AWS Enterprise On-Ramp Support", "AWS Business Support", "AWS Enterprise Support"],
        answer: ["AWS Business Support"],
        type: "single"
    },
    {
        question: "A startup wants to provision an EC2 instance for the lowest possible cost for a long-term duration but needs to make sure that the instance would never be interrupted. As a Cloud Practitioner, which of the following options would you recommend?",
        options: ["EC2 Reserved Instance (RI)", "EC2 Dedicated Host", "EC2 Spot Instance", "EC2 On-Demand Instance"],
        answer: ["EC2 Reserved Instance (RI)"],
        type: "single"
    },
    {
        question: "The DevOps team at an IT company is moving 500 GB of data from an EC2 instance to an S3 bucket in the same region. Which of the following scenario captures the correct charges for this data transfer?",
        options: ["The company would only be charged for the inbound data transfer into the S3 bucket", "The company would only be charged for the outbound data transfer from EC2 instance", "The company would be charged for both the outbound data transfer from EC2 instance as well as the inbound data transfer into the S3 bucket", "The company would not be charged for this data transfer"],
        answer: ["The company would not be charged for this data transfer"],
        type: "single"
    },
    {
        question: "Which of the following AWS Support plans provide access to guidance, configuration, and troubleshooting of AWS interoperability with third-party software? (Select two)",
        options: ["AWS Developer Support", "AWS Corporate Support", "AWS Enterprise Support", "AWS Business Support", "AWS Basic Support"],
        answer: ["AWS Enterprise Support", "AWS Business Support"],
        type: "multiple"
    },
    {
        question: "A Project Manager, working on AWS for the first time, is confused about how credits are used in AWS. There are two credits available in the manager's account. Credit one is for $100, expires July 2022, and can be used for either Amazon S3 or Amazon EC2. Credit two is for $50, expires December 2022, and can be used only for Amazon EC2. The manager's AWS account has incurred two charges: $1000 for Amazon EC2 and $500 for Amazon S3. What will be the outcome on the overall bill once the credits are used? (Select two)",
        options: ["Then, credit two is applied to $500 for Amazon S3 usage", "Then, credit two is applied to the remaining $900 of Amazon EC2 usage", "Credit one is applied, which expires in July, to the Amazon EC2 charge which leaves you with a $900 Amazon EC2 charge and a $500 Amazon S3 charge", "Credit one is applied, which expires in July, to Amazon S3 usage which leaves you with a $1000 Amazon EC2 charge and a $400 Amazon S3 charge"],
        answer: ["Credit one is applied, which expires in July, to the Amazon EC2 charge which leaves you with a $900 Amazon EC2 charge and a $500 Amazon S3 charge", "Then, credit two is applied to the remaining $900 of Amazon EC2 usage"],
        type: "multiple"
    },
    {
        question: "Credit one is applied, which expires in July, to Amazon S3 usage which leaves you with a $1000 Amazon EC2 charge and a $400 Amazon S3 charge",
        options: ["Amazon Simple Storage Service (Amazon S3)", "Amazon Elastic Compute Cloud (Amazon EC2)", "Amazon DynamoDB", "Amazon Relational Database Service (Amazon RDS)"],
        answer: ["Amazon Elastic Compute Cloud (Amazon EC2)", "Amazon DynamoDB", "Amazon Relational Database Service (Amazon RDS)"],
        type: "multiple"
    },
    {
        question: "Which of the following is the MOST cost-effective option to purchase an EC2 Reserved Instance (RI)?",
        options: ["No upfront payment option with standard 3-years term", "All upfront payment option with the standard 1-year term", "No upfront payment option with standard 1-year term", "Partial upfront payment option with standard 3-years term"],
        answer: ["Partial upfront payment option with standard 3-years term"],
        type: "single"
    },
    {
        question: "A startup wants to set up its IT infrastructure on AWS Cloud. The CTO would like to get an estimate of the monthly AWS bill based on the AWS services that the startup wants to use. As a Cloud Practitioner, which AWS service would you suggest for this use-case?",
        options: ["AWS Budgets", "AWS Cost & Usage Report (AWS CUR)", "AWS Pricing Calculator", "AWS Cost Explorer"],
        answer: ["AWS Pricing Calculator"],
        type: "single"
    },
    {
        question: "An intern at an IT company provisioned a Linux based On-demand EC2 instance with per-second billing but terminated it within 30 seconds as he wanted to provision another instance type. What is the duration for which the instance would be charged?",
        options: ["60 seconds", "30 seconds", "300 seconds", "600 seconds"],
        answer: ["60 seconds"],
        type: "single"
    }
],

// Technology

[
    {
        question: "Which AWS services can be used to facilitate organizational change management, part of the Reliability pillar of AWS Well-Architected Framework? (Select three)",
        options: ["AWS Config", "Amazon GuardDuty", "Amazon CloudWatch", "AWS CloudTrail", "Amazon Inspector"],
        answer: ["AWS Config", "Amazon CloudWatch", "AWS CloudTrail"],
        type: "multiple"
    },
    {
        question: "A company wants to identify the optimal AWS resource configuration for its workloads so that the company can reduce costs and increase workload performance. Which of the following services can be used to meet this requirement?",
        options: ["AWS Compute Optimizer", "AWS Budgets", "AWS Cost Explorer", "AWS Systems Manager"],
        answer: ["AWS Compute Optimizer"],
        type: "single"
    },
    {
        question: "A silicon valley based healthcare startup stores anonymized patient health data on Amazon S3. The CTO further wants to ensure that any sensitive data on S3 is discovered and identified to prevent any sensitive data leaks. As a Cloud Practitioner, which AWS service would you recommend addressing this use-case?",
        options: ["AWS Glue", "Amazon Macie", "Amazon Polly", "AWS Secrets Manager"],
        answer: ["Amazon Macie"],
        type: "single"
    },
    {
        question: "The DevOps team at an e-commerce company is trying to debug performance issues for its serverless application built using a microservices architecture. As a Cloud Practitioner, which AWS service would you recommend addressing this use-case?",
        options: ["Amazon Pinpoint", "AWS Trusted Advisor", "AWS CloudFormation", "AWS X-Ray"],
        answer: ["AWS X-Ray"],
        type: "single"
    }, {
        question: "Which AWS Route 53 routing policy would you use to route traffic to multiple resources and also choose how much traffic is routed to each resource?",
        options: ["latency-based routing", "Simple routing", "Weighted routing", "Failover routing"],
        answer: ["Weighted routing"],
        type: "single"
    },
    {
        question: "Which of the following entities applies patches to the underlying OS for Amazon Aurora?",
        options: ["The AWS Product Team automatically", "The AWS customer by SSHing on the instances", "The AWS customer by using AWS Systems Manager", "The AWS Support after receiving a request from the customer"],
        answer: ["The AWS Product Team automatically"],
        type: "single"
    },
    {
        question: "A big data analytics company is moving its IT infrastructure from an on-premises data center to AWS Cloud. The company has some server-bound software licenses that it wants to use on AWS. As a Cloud Practitioner, which of the following EC2 instance types would you recommend to the company?",
        options: ["Dedicated Instance", "Dedicated Host", "On-Demand Instance", "Reserved Instance (RI)"],
        answer: ["Dedicated Host"],
        type: "single"
    },
    {
        question: "A company wants to improve the resiliency of its flagship application so it wants to move from its traditional database system to a managed AWS NoSQL database service to support active-active configuration in both the East and West US AWS regions. The active-active configuration with cross-region support is the prime criteria for any database solution that the company considers. Which AWS database service is the right fit for this requirement?",
        options: ["Amazon Aurora with multi-master clusters", "Amazon DynamoDB with DynamoDB Accelerator", "Amazon Relational Database Service (Amazon RDS) for MYSQL", "Amazon DynamoDB with global tables"],
        answer: ["Amazon DynamoDB with global tables"],
        type: "single"
    },
    {
        question: "Which of the following is an AWS database service?",
        options: ["AWS Database Migration Service (AWS DMS)", "Amazon Redshift", "AWS Storage Gateway", "AWS Glue"],
        answer: ["Amazon Redshift"],
        type: ""
    },
    {
        question: "Compared to the on-demand instance prices, what is the highest possible discount offered for spot instances?",
        options: ["10", "50", "75", "90"],
        answer: ["90"],
        type: "single"
    },
    {
        question: "Which of the following is a serverless AWS service?",
        options: ["Amazon Elastic Compute Cloud (Amazon EC2)", "AWS Lambda", "Amazon EMR", "AWS Elastic Beanstalk"],
        answer: ["AWS Lambda"],
        type: "single"
    },
    {
        question: "A data analytics company is running a proprietary batch analytics application on AWS and wants to use a storage service which would be accessed by hundreds of EC2 instances simultaneously to append data to existing files. As a Cloud Practitioner, which AWS service would you suggest for this use-case?",
        options: ["Instance Store", "Amazon Elastic File System (Amazon EFS)", "Amazon Elastic Block Store (Amazon EBS)", "Amazon Simple Storage Service (Amazon S3)"],
        answer: ["Amazon Elastic File System (Amazon EFS)"],
        type: "single"
    },
    {
        question: "Which of the following Amazon S3 storage classes takes the most time to retrieve data (also known as first byte latency)?",
        options: ["Amazon S3 Standard", "Amazon S3 Glacier Flexible Retrieval", "Amazon S3 Intelligent-Tiering", "Amazon S3 Glacier Deep Archive"],
        answer: ["Amazon S3 Glacier Deep Archive"],
        type: "single"
    },
    {
        question: "Which of the following statements are CORRECT regarding the Availability Zone (AZ) specific characteristics of Amazon Elastic Block Store (EBS) and Amazon Elastic File System (Amazon EFS) storage types?",
        options: ["EBS volume can be attached to one or more instances in multiple Availability Zones (AZ) and EFS file system can be mounted on instances in the same Availability Zone (AZ)", "EBS volume can be attached to a single instance in the same Availability Zone (AZ) and EFS file system can only be mounted on instances in the same Availability Zone (AZ)", "EBS volume can be attached to one or more instances in multiple Availability Zones (AZ) and EFS file system can be mounted on instances across multiple Availability Zones (AZ)", "EBS volume can be attached to a single instance in the same Availability Zone (AZ) whereas EFS file system can be mounted on instances across multiple Availability Zones (AZ)"],
        answer: ["EBS volume can be attached to a single instance in the same Availability Zone (AZ) whereas EFS file system can be mounted on instances across multiple Availability Zones (AZ)"],
        type: "single"
    },
    {
        question: "A research group wants to use EC2 instances to run a scientific computation application that has a fault tolerant architecture. The application needs high-performance hardware disks that provide fast I/O performance. As a Cloud Practitioner, which of the following storage options would you recommend as the MOST cost-effective solution?",
        options: ["Amazon Elastic File System (Amazon EFS)", "Amazon Simple Storage Service (Amazon S3)", "Instance Store", "Amazon Elastic Block Store (EBS)"],
        answer: ["Instance Store"],
        type: "single"
    },
    {
        question: "Which of the following AWS services should be used to automatically distribute incoming traffic across multiple targets?",
        options: ["AWS Elastic Load Balancing (ELB)", "AWS Elastic Beanstalk", "Amazon OpenSearch Service", "AWS Auto Scaling"],
        answer: ["AWS Elastic Load Balancing (ELB)"],
        type: "single"
    },
    {
        question: "Which AWS services can be used to decouple components of a microservices based application on AWS Cloud? (Select two)",
        options: ["AWS Lambda", "AWS Step Functions", "Amazon Simple Notification Service (SNS)", "Amazon Simple Queue Service (SQS)"],
        answer: ["Amazon Simple Queue Service (SQS)", "Amazon Simple Notification Service (SNS)"],
        type: "multiple"
    },
    {
        question: "A company needs a storage solution for a project wherein the data is accessed less frequently but needs rapid access when required. Which S3 storage class is the MOST cost-effective for the given use-case?",
        options: ["Amazon S3 Standard", "Amazon S3 Glacier (S3 Glacier)", "Amazon S3 Intelligent-Tiering (S3 Intelligent-Tiering)", "Amazon S3 Standard-Infrequent Access (S3 Standard-IA)"],
        answer: ["Amazon S3 Standard-Infrequent Access (S3 Standard-IA)"],
        type: "single"
    },
    {
        question: "Which tool/service will help you access AWS services using programming language-specific APIs?",
        options: ["AWS Command Line Interface (CLI)", "AWS Software Developer Kit (SDK)", "Integrated Development Environments (IDE)", "AWS Management Console"],
        answer: ["AWS Software Developer Kit (SDK)"],
        type: "single"
    },
    {
        question: "Which of the following are correct statements regarding the AWS Global Infrastructure? (Select two)",
        options: ["Each Availability Zone (AZ) consists of one or more discrete data centers", "Each Availability Zone (AZ) consists of two or more discrete data centers", "Each AWS Region consists of a minimum of two Availability Zones (AZ)", "Each AWS Region consists of two or more Edge Locations", "Each AWS Region consists of a minimum of three Availability Zones (AZ)"],
        answer: ["Each Availability Zone (AZ) consists of one or more discrete data centers", "Each AWS Region consists of a minimum of three Availability Zones (AZ)"],
        type: "multiple"
    },
    {
        question: "A unicorn startup is building an analytics application with support for a speech-based interface. The application will accept speech-based input from users and then convey results via speech. As a Cloud Practitioner, which solution would you recommend for the given use-case?",
        options: ["Use Amazon Transcribe to convert speech to text for downstream analysis. Then use Amazon Polly to convey the text results via speech", "Use Amazon Polly to convert speech to text for downstream analysis. Then use Amazon Transcribe to convey the text results via speech", "Use Amazon Polly to convert speech to text for downstream analysis. Then use Amazon Translate to convey the text results via speech", "Use Amazon Translate to convert speech to text for downstream analysis. Then use Amazon Polly to convey the text results via speech"],
        answer: ["Use Amazon Transcribe to convert speech to text for downstream analysis. Then use Amazon Polly to convey the text results via speech"],
        type: "single"
    },
    {
        question: "Which of the following are the storage services offered by the AWS Cloud? (Select two)",
        options: ["Amazon Simple Storage Service (Amazon S3)", "Amazon Simple Queue Service (SQS)", "Amazon Elastic Compute Cloud (Amazon EC2)", "Amazon Elastic File System (Amazon EFS)", "Amazon Simple Notification Service (SNS)"],
        answer: ["Amazon Simple Storage Service (Amazon S3)", "Amazon Elastic File System (Amazon EFS)"],
        type: "multiple"
    }
]

]
